<?php

return [

    'bank_codes' => [
        // '01' => '한국은행',
        // '02' => '한국산업은행',
        '03' => 'IBK기업은행',
        '04' => 'KB국민은행',
        '05' => 'KEB하나은행',
        '07' => '수협중앙회',
        '11' => 'NH농협은행',
        '12' => '단위농협(지역농.축협)',
        '20' => '우리은행',
        '23' => 'SC제일은행',
        // '24' => '한일은행',
        // '25' => '서울은행',
        // '26' => '구)신한은행',
        // '27' => '한국씨티은행',
        '31' => '대구은행',
        '32' => '부산은행',
        '34' => '광주은행',
        '35' => '제주은행',
        '37' => '전북은행',
        '38' => '강원은행',
        '39' => '경남은행',
        '45' => '새마을금고',
        '48' => '신협',
        '60' => 'BOA(뱅크오브아메리카)',
        '71' => '우체국',
        '81' => '하나은행',
        '88' => '신한은행',
        '89' => '케이뱅크은행',
        '90' => '카카오뱅크',
        '92' => '토스뱅크',
    ],

];
