@extends('layouts.header')

@section('content')


<div class="sub-container">
  <div class="sub-title-wrap">
      <h4>회원가입</h4>  
  </div>

  <div class="join-wrap">

    <h3>가입약관 동의<span>회원가입을 위해 이용약관 및 개인정보 수집 및 이용에 관한 안내를 읽고 동의해주세요.</span></h3>

    <div class="terms-box">
      <h5>전자금융거래 이용약관</h5>
      <div class="terms-scroll">
        <p>제1조 (목적)</p>
        <p>이 약관은 "삼마몰"이 운영하는 온라인 웹 페이지(이하 "페이지"라 한다)에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 한다)를 이용함에 있어 과 이용자의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.</p>
        <p>제2조 (정의)</p>
        <p>
          1. "페이지"란 이 재화 또는 용역을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신 설비를 이용하여 재화 또는 용역을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 웹 페이지를 운영하는 사업자의 의미로도 사용합니다.<br>
          2. "이용자"란 "페이지"에 접속하여 이 약관에 따라 "페이지"가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.<br>
          3. "회원"이라 함은 "페이지"에 개인 정보를 제공하여 회원 등록을 한 자로서, "페이지"의 정보를 지속적으로 제공받으며, "페이지"가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.<br>
          4. "비회원"이라 함은 회원에 가입하지 않고 "페이지"가 제공하는 서비스를 이용하는 자를 말합니다.
        </p>
        <p>제3조 (약관의 명시와 개정)</p>
        <p>
          1. "페이지"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 ( 전화, 팩스, 전자우편 주소 등 ) 등을 이용자가 알 수 있도록 온라인 의 초기 서비스 화면( 전면 )에 게시합니다.<br>
          2. "페이지"는 약관의규제에관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에 관한법률, 방문판매등에관한법률, 소비자보호법 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.<br>
          3. "페이지"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 몰의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.<br>
          4. "페이지"가 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지 기간 내에 "페이지"에 송신하여 "페이지"의 동의를 받은 경우에는 개정 약관 조항이 적용됩니다.<br>
          5. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 전자거래소 비자보호지침 및 관계법령 또는 상관례에 따릅니다.
        </p>
        <p>제4조 ( 서비스의 제공 및 변경 )</p>
        <p>
          1. "페이지"는 다음과 같은 업무를 수행합니다.<br>


          2 "페이지"는 재화의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화·용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화·용역의 내용 및 제공일자를 명시하여 현재의 재화·용역의 내용을 게시한 곳에 그 제공일자 이전 7일부터 공지합니다.<br>
          3 "페이지"가 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 "페이지"는 이로 인하여 이용자가 입은 손해를 배상합니다. 단, "페이지"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.
        </p>
        <p>제5조 ( 서비스의 중단 )</p>
        <p>
          1. "페이지"는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.<br>
          2. 제1항에 의한 서비스 중단의 경우에는 "페이지"는 제8조에 정한 방법으로 이용자에게 통지 합니다.<br>
          3. "페이지"는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단 "페이지"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.</p>
        <p>제6조 ( 회원 가입 )</p>
        <p>
          1. 이용자는 "페이지"가 정한 가입 양식에 따라 회원 정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.<br>
          2. "페이지"는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.<br>
          <ol>
              <li>가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원 자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원 자격 상실 후 3년이 경과한 자로서 "페이지"의 회원 재가입 승낙을 얻은 경우에는 예외로 한다.</li>
              <li>등록 내용에 허위, 기재 누락, 오기가 있는 경우</li>
              <li>기타 회원으로 등록하는 것이 "페이지"의 기술상 현저히 지장이 있다고 판단되는 경우</li>
          </ol>
          3. 회원 가입 계약의 성립시기는 "페이지"의 승낙이 회원에게 도달한 시점으로 합니다.<br>
          4. 회원은 제15조제1항에 의한 등록사항에 변경이 있는 경우, 즉시 전자 우편 또는 기타 방법으로 "페이지"에 대하여 그 변경사항을 알려야 합니다.
        </p>
        <p>제7조 ( 회원 탈퇴 및 자격 상실 등 )</p>
        <p>
          1. 회원은 "페이지"에 언제든지 탈퇴를 요청할 수 있으며 "페이지"는 즉시 회원 탈퇴를 처리합니다.<br>
          2. 회원이 다음 각 호의 사유에 해당하는 경우, "페이지"는 회원자격을 제한 및 정지시킬 수 있습니다.<br>
          <ol>
              <li>가입 신청 시에 허위 내용을 등록한 경우</li>
              <li>"페이지"를 이용하여 구입한 재화·용역 등의 대금, 기타 "페이지" 이용에 관련 하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우</li>
              <li>다른 사람의 "페이지" 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우</li>
              <li>"페이지"를 이용하여 법령과 이 약관이 금지하거나 공공 질서나 미풍양속에 반하는 행위를 하는 경우</li>
          </ol>
          3. "페이지"가 회원 자격을 제한/정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 "페이지"는 회원 자격을 상실 시킬 수 있습니다.<br>
          4. "페이지"가 회원 자격을 상실 시키는 경우에는 회원 등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원 등록 말소 전에 소명할 기회를 부여합니다.<br>
          5. "페이지"가 회원에 대한 통지를 하는 경우, 회원이 "페이지"에 제출한 전자우편 주소로 할 수 있습니다.<br>
          6. "페이지"는 불특정다수 회원에 대한 통지의 경우 1주일 이상 "페이지" 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
        </p>
        <p>제8조 (회원에 대한 통지)</p>
        <p>
          1. "페이지"가 회원에 대한 통지를 하는 경우, 회원이 "페이지"에 제출한 전자우편 주소로 할 수 있습니다.<br>
          2. "페이지"는 불특정다수 회원에 대한 통지의 경우 1주일 이상 "페이지" 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
        </p>
        <p>제9조 (구매신청)</p>
        <p>페이지" 이용자는 "페이지" 상에서 이하의 방법에 의하여 구매를 신청합니다.<br>
          <ol>
            <li>성명, 주소, 전화번호 입력</li>
            <li>재화 또는 용역의 선택</li>
            <li>결제방법의 선택</li>
            <li>이 약관에 동의한다는 표시(예, 마우스 클릭)</li>
          </ol>
        </p>
        <p>제10조 ( 계약의 성립 )</p>
        <p>1. "페이지"는 제9조와 같은 구매신청에 대하여 다음 각 호에 해당하지 않는 한 승낙합니다.
                    <ol>
                        <li>신청 내용에 허위, 기재누락, 오기가 있는 경우</li>
                        <li>미성년자가 담배, 주류 등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우</li>
                        <li>기타 구매신청에 승낙하는 것이 "페이지" 기술상 현저히 지장이 있다고 판단하는 경우</li>
                    </ol>
                  2. "페이지"의 승낙이 제12조제1항의 수신확인통지형태로 이용자에게 도달한 시점에 계약이 성립한 것으로 봅니다.</p>
        <p>제11조 ( 지급 방법 )</p>
        <p>"페이지"에서 구매한 재화 또는 용역에 대한 대금 지급 방법은 다음 각 호의 하나로 할 수 있습니다.
                      <ol>
                          <li>계좌이체</li>
                          <li>신용카드결제</li>
                          <li>온라인무통장입금</li>
                          <li>전자화폐에 의한 결제</li>
                          <li>수령 시 대금 지급 등</li>
                      </ol>
                    </p>

        <p>제12조 ( 수신 확인 통지, 구매 신청 변경 및 취소 )</p>  
        <p>1. "페이지"는 이용자의 구매 신청이 있는 경우 이용자에게 수신 확인 통지를 합니다.<br>
                  2. 수신 확인 통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신 확인 통지를 받은 후 즉시 구매 신청 변경 및 취소를 요청할 수 있습니다.<br>
                  3. "페이지"는 배송 전 이용자의 구매 신청 변경 및 취소 요청이 있는 때에는 지체 없이 그 요청에 따라 처리합니다.</p>           
        <p>제13조 ( 배송 )</p> 
        <p>"페이지"는 이용자가 구매한 재화에 대해 배송 수단, 수단별 배송비용 부담자, 수단별 배송 기간 등을 명시합니다. 만약 "페이지"의 고의 또는 과실로 약정 배송기간을 초과한 경우에는 그로 인한 이용자의 손해를 배상합니다.</p> 
        <p>제14조 ( 환급, 반품 및 교환 )</p> 
        <p>1. "페이지"는 이용자가 구매 신청한 재화 또는 용역이 품절 등의 사유로 재화의 인도 또는 용역의 제공을 할 수 없을 때에는 지체 없이 그 사유를 이용자에게 통지하고, 사전에 재화 또는 용역의 대금을 받은 경우에는 대금을 받은 날부터 3일 이내에, 그렇지 않은 경우에는 그 사유 발생일로부터 3일 이내에 계약해제 및 환급절차를 취합니다.<br>
                  2. 다음 각 호의 경우에는 "페이지"는 배송 된 재화일지라도 재화를 반품 받은 다음 영업일 이내에 이용자의 요구에 따라 즉시 환급, 반품 및 교환 조치를 합니다. 다만 그 요구기한은 배송 된 날로부터 20일 이내로 합니다.<br>
                      <ol>
                          <li>배송 된 재화가 주문내용과 상이하거나 "페이지"가 제공한 정보와 상이할 경우</li>
                          <li>배송 된 재화가 파손, 손상되었거나 오염되었을 경우</li>
                          <li>재화가 광고에 표시된 배송 기간보다 늦게 배송 된 경우</li>
                          <li>방문판매등에관한법률 제18조에 의하여 광고에 표시하여야 할 사항을 표시하지 아니한 상태에서 이용자의 청약이 이루어진 경우</li>
                      </ol></p> 
        <p>제15조 ( 개인 정보 보호 )</p> 
        <p>1. "페이지"는 이용자의 정보 수집 시 구매계약 이행에 필요한 최소한의 정보를 수집합니다.
                  다음 사항을 필수사항으로 하며 그 외 사항은 선택사항으로 합니다.
                      <ol>
                          <li>성명</li>
                          <li>주민등록번호( 회원의 경우 )</li>
                          <li>주소</li>
                          <li>전화번호</li>
                          <li>희망ID( 회원의 경우 )</li>
                          <li>비밀번호( 회원의 경우 )</li>
                      </ol>
                  2. "페이지"가 이용자의 개인 식별이 가능한 개인 정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다.<br>
                  3. 제공된 개인 정보는 당해 이용자의 동의 없이 목적 외의 이용이나 제3자에게 제공할 수 없으며, 이에 대한 모든 책임은 "페이지"가 집니다. 다만, 다음의 경우에는 예외로 합니다.<br>
                      <ol>
                          <li>배송 업무상 배송 업체에게 배송에 필요한 최소한의 이용자의 정보( 성명, 주소, 전화번호 )를 알려주는 경우</li>
                          <li>통계작성, 학술연구 또는 시장 조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우</li>
                      </ol>
                  4. "페이지"가 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인 정보 관리 책임자의 신원( 소속, 성명 및 전화번호 기타 연락처 ), 정보의 수집 목적 및 이용 목적, 제3자에 대한 정보 제공 관련 사항( 제공받는 자, 제공 목적 및 제공할 정보의 내용 ) 등 정보통신망 이용촉진등에관한법률 제16조제3항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.<br>
                  5. 이용자는 언제든지 "페이지"가 가지고 있는 자신의 개인 정보에 대해 열람 및 오류 정정을 요구할 수 있으며 "페이지"는 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 "페이지"는 그 오류를 정정할 때까지 당해 개인 정보를 이용하지 않습니다.<br>
                  6. "페이지"는 개인 정보 보호를 위하여 관리자를 한정하여 그 수를 최소화 하며 신용카드, 은행 계좌 등을 포함한 이용자의 개인 정보의 분실, 도난, 유출, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.<br>
                  ⑦ "페이지" 또는 그로부터 개인 정보를 제공받은 제3자는 개인 정보의 수집 목적 또는 제공받은 목적을 달성한 때에는 당해 개인 정보를 지체 없이 파기합니다.</p> 
        <p>제16조 ( "페이지"의 의무 )</p> 
        <p>1. "페이지"는 법령과 이 약관이 금지하거나 공공 질서 또는 미풍양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화/용역을 제공하는 데 최선을 다하여야 합니다.<br>
                  2. "페이지"는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인 정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.<br>
                  3. "페이지"가 제품이나 용역에 대하여 「표시·광고의공정화에관한법률」 제3조 소정의 부당한 표시·광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.<br>
                  4. "페이지"는 이용자가 원하지 않는 영리 목적의 광고성 전자우편을 발송하지 않습니다.</p>

                  <p>제17조 ( 회원의 ID 및 비밀번호에 대한 의무 )</p>
                  <p>1. 제15조의 경우를 제외한 ID와 비밀번호에 관한 관리 책임은 회원에게 있습니다.<br>
                  2. 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.<br>
                  3. 회원이 자신의 ID 및 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 "페이지"에 통보하고 "페이지"의 안내가 있는 경우에는 그에 따라야 합니다.</p> 
        <p>제18조 ( 이용자의 의무 )</p> 
        <p>이용자는 다음 행위를 하여서는 안됩니다.<br>
                      <ol>
                          <li>신청 또는 변경 시 허위내용의 등록</li>
                          <li>"페이지"에 게시된 정보의 변경</li>
                          <li>"페이지"가 정한 정보 이외의 정보( 컴퓨터 프로그램 등 )의 송신 또는 게시</li>
                          <li>"페이지" 또는 기타 제3자의 저작권 등 지적재산권에 대한 침해</li>
                          <li>"페이지" 또는 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</li>
                          <li>외설 또는 폭력적인 메시지/화상/음성 기타 공공 질서 혹은 미풍양속에 반하는 정보를 몰에 공개 또는 게시하는 행위</li>
                      </ol></p> 
        <p>제19조 (연결 "페이지"와 피연결 "페이지" 간의 관계)</p> 
        <p>1. 상위 "페이지"와 하위 "페이지"가 하이퍼 링크( 예: 하이퍼 링크의 대상에는 문자, 그림 및 동화상 등이 포함됨 )방식 등으로 연결된 경우, 전자를 연결 "페이지" (웹 사이트)라고 하고 후자를 피연결 "페이지" (웹사이트)라고 합니다.<br>
                  2. 연결 "페이지"는 피연결 "페이지"가 독자적으로 제공하는 재화/용역에 의하여 이용자와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 연결 "페이지"의 사이트에서 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.</p>
        <p>제20조 ( 저작권의 귀속 및 이용제한 )</p>
        <p>1. "페이지"가 작성한 저작물에 대한 저작권 기타 지적재산권은 "페이지"에 귀속합니다.<br>
                  2. 이용자는 "페이지"를 이용함으로써 얻은 정보를 "페이지"의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.</p>
        <p>제21조 ( 분쟁해결 )</p>
        <p>1. "페이지"는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상 처리하기 위하여 피해 보상 처리 기구를 설치·운영합니다.<br>
                  2. "페이지"는 이용자로부터 제출되는 불만 사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리 일정을 즉시 통보해 드립니다.<br>
                  3. "페이지"와 이용자 간에 발생한 분쟁은 전자거래기본법 제28조 및 동 시행령 제15조에 의하여 설치된 전자거래분쟁조정위원회의 조정에 따를 수 있습니다.</p>
        <p>제22조 ( 재판권 및 준거법 )</p>
        <p>1. "페이지"와 이용자 간에 발생한 전자거래 분쟁에 관한 소송은 민사소송법상의 관할법원에 제기합니다.<br>
                  2. "페이지"와 이용자간에 제기된 전자거래 소송에는 한국법을 적용합니다.</p>

      </div>
    <label><input type="checkbox" name="agree" class="agree_check" id="agree" value="1">이용약관에 동의합니다.</label>

  </div>

  <div class="terms-box">
    <h5>개인정보 수집 및 이용, 개인정보 제공</h5>
    <div class="terms-scroll">
      <p>"삼마몰"은 고객님의 개인정보를 중요시하며, 정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다.</p>
      <p>회사는 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. 회사는 개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.</p>
      <p>* 본 방침은 : 2020 년 06 월 01 일 부터 시행됩니다.</p>
      <p>수집하는 개인정보 항목 <br>
            회사는 회원가입, 상담, 서비스 신청 등등을 위해 아래와 같은 개인정보를 수집하고 있습니다.<br>
            - 수집항목 : 이름 , 로그인ID , 비밀번호 , 자택 전화번호 , 자택 주소 , 휴대전화번호 , 이메일 , 서비스 이용기록 , 접속 로그 , 쿠키 , 접속 IP 정보<br>
            - 개인정보 수집방법 : 홈페이지(회원가입)<br>
            개인정보의 수집 및 이용목적<br>
            회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.<br>
            - 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산 콘텐츠 제공 구매 및 요금 결제 , 물품배송 또는 청구지 등 발송<br>
            - 회원 관리<br>
            회원제 서비스 이용에 따른 본인확인 , 개인 식별 , 불량회원의 부정 이용 방지와 비인가 사용 방지 , 가입 의사 확인 , 불만처리 등 민원처리 , 고지사항 전달<br>
            - 마케팅 및 광고에 활용<br>
            신규 서비스(제품) 개발 및 특화<br>
            개인정보의 보유 및 이용기간<br>
            회사는 개인정보 수집 및 이용목적이 달성된 후에는 예외 없이 해당 정보를 지체 없이 파기합니다.<br>
            개인정보의 파기절차 및 방법<br>
            회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다.<br>
            파기절차 및 방법은 다음과 같습니다.<br>
            - 파기절차<br>
            회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져 (종이의 경우 별도의 서류함)<br>
            내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 일정 기간 저장된 후 파기되어집니다.<br>
            별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.<br>
            - 파기방법<br>
            전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.<br>
            개인정보 제공<br>
            회사는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다.<br>
            다만, 아래의 경우에는 예외로 합니다.<br>
            - 이용자들이 사전에 동의한 경우<br>
            - 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우<br>
            수집한 개인정보의 위탁<br>
            회사는 이용자의 개인정보를 원칙적으로 위탁하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.<br>
            - 택배를 통한 주문상품의 배송시<br>
            이용자 및 법정대리인의 권리와 그 행사방법<br>
            이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.<br>
            
            이용자들의 개인정보 조회,수정을 위해서는 ‘개인정보변경’(또는 ‘회원정보수정’ 등)을 가입해지(동의철회)를 위해서는 “회원탈퇴”를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.<br>
                
            혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 조치하겠습니다.<br>
                
            귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다.<br>
            또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.<br>
                
            회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 “회사가 수집하는 개인정보의 보유 및 이용기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.<br>
            개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항<br>
            회사는 귀하의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’ 등을 운용합니다.<br>
            쿠키란 oo의 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다. 회사은(는) 다음과 같은 목적을 위해 쿠키를 사용합니다.<br>
            쿠키 등 사용 목적<br>
            - 회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및
            방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공 귀하는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 귀하는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.<br>
            쿠키 설정 거부 방법<br>
            예: 쿠키 설정을 거부하는 방법으로는 회원님이 사용하시는 웹 브라우저의 옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수 있습니다.<br>
            설정방법 예(인터넷 익스플로어의 경우) : 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보<br>
            <br>
            단, 귀하께서 쿠키 설치를 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.<br>
            개인정보에 관한 민원서비스<br>
            회사는 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.<br>

            <!--
            개인정보관리책임자 성명 : <br>
            전화번호 : <br>
            이메일 : <br>
            귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다.<br>
            회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.<br>
            기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.<br>
            1.개인분쟁조정위원회 (www.1336.or.kr/1336)<br>
            2.정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4)<br>
            3.대검찰청 인터넷범죄수사센터 (icic.sppo.go.kr/02-3480-3600)<br>
            4.경찰청 사이버테러대응센터 (www.ctrc.go.kr/02-392-0330)<br>
              -->
          </p>
      </div>

      <label><input type="checkbox" name="agree2" class="agree_check" id="agree2" value="1">개인정보 보호정책에 동의합니다.</label><br>
      <label class="txt-blue"><input type="checkbox" name="all" id="all">모두 동의합니다.</label>
    </div>

    <button type="button" class="btn3 big-btn" onclick="agreeChk()">회원가입</button>
  </div>

</div>



<script>
  $(document).ready(function() {
    // 전체 선택/해제
    $('#all').click(function() {
        $('.agree_check').prop('checked', this.checked);
    });

    // 개별 체크박스 상태 변경 시 전체 체크박스 상태 반영
    $('.agree_check').change(function() {
      if ($('.agree_check:checked').length === $('.agree_check').length) {
          // 모든 체크박스가 체크되어 있으면 #all 체크
          $('#all').prop('checked', true);
      } else {
          // 하나라도 체크 안 되어 있으면 #all 체크 해제
          $('#all').prop('checked', false);
      }
    });
  });


  function agreeChk() {
    //이용약관 동의 체크
    if ($('#agree').is(':checked') == false) {
      validationAlertMessage('이용약관에 동의하셔야만 회원가입이 가능합니다.');
      return false;
    }

    //개인정보 보호정책 동의 체크
    if ($('#agree2').is(':checked') == false) {
      validationAlertMessage('개인정보 보호정책에 동의하셔야만 회원가입이 가능합니다.');
      return false;
    }

    setCookie('joinAgree', 'done');
    location.href='/join';
  }

  function validationAlertMessage(message)  {
    Swal.fire({
        toast: true,
        icon: 'warning',
        title: '알림',
        html: message,
        confirmButtonText: '확인'
    });
  }
</script>


@endsection


